App/DataProcessors/ТекущийВес.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ТекущийВес</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

App/InformationRegisters/ИзмеренияЧеловека.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ИзмеренияЧеловека</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Рост</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемГруди</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбхватПлеча</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемТалии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователь</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

App/DataProcessors/ТекущийВес/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОбновитьГрафик(ДатаНачала, ДатаОкончания)
	
	Если НЕ ЗначениеЗаполнено(ДатаНачала) ИЛИ НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда
		Сообщить("Не заполнен период формирования");
		Возврат;
	КонецЕсли;
	
	График.Обновление = Ложь;
	
	ДанныеДиаграммы = ПолучитьДанные(ДатаНачала, ДатаОкончания);
	
	График.Очистить();
	
	График.Серии.Добавить("Вес");
	
	Для Каждого ТекСтр Из ДанныеДиаграммы Цикл
		Точка = График.УстановитьТочку(Формат(ТекСтр.Период,"ДФ=dd.MM.yy"));
		График.УстановитьЗначение(Точка,График.Серии[0],ТекСтр.Вес);
	КонецЦикла;
	
	График.Обновление = Истина;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанные(ДатаНачала, ДатаОкончания)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала",ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",ДатаОкончания);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИзмеренияЧеловека.Период КАК Период,
	               |	ИзмеренияЧеловека.Вес КАК Вес
	               |ИЗ
	               |	РегистрСведений.ИзмеренияЧеловека КАК ИзмеренияЧеловека
				   |ГДЕ
				   |	ИзмеренияЧеловека.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
				   |УПОРЯДОЧИТЬ ПО
				   |	ИзмеренияЧеловека.Период";
	
	РЗ = Запрос.Выполнить().Выгрузить();
	
	МассивЗначений = Новый Массив;
	
	Для Каждого ТекСтр Из РЗ Цикл
		СтруктураНабора = Новый Структура("Период,Вес",ТекСтр.Период,ТекСтр.Вес);
		МассивЗначений.Добавить(СтруктураНабора);		
	КонецЦикла;
	
	Возврат МассивЗначений;
		
КонецФункции

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ОбновитьГрафик(Период.ДатаНачала,Период.ДатаОкончания);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Период.ДатаНачала = НачалоНедели(ТекущаяДата());
	Период.ДатаОкончания = КонецНедели(ТекущаяДата());
	
	ОбновитьГрафик(Период.ДатаНачала,Период.ДатаОкончания);
	
	ОбновитьТекущийВес();
	
КонецПроцедуры


&НаСервере
Процедура ОбновитьТекущийВес()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИзмеренияЧеловекаСрезПоследних.Вес КАК Вес
	               |ИЗ
	               |	РегистрСведений.ИзмеренияЧеловека.СрезПоследних(&Период, ) КАК ИзмеренияЧеловекаСрезПоследних";
	
	Запрос.УстановитьПараметр("Период",ТекущаяДата());
	
	РЗ = Запрос.Выполнить().Выгрузить();

	Если РЗ.Количество() Тогда
		ТекущийВес = РЗ.Получить(0).Вес;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВнестиИзменения(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВнестиИзмененияЗавершение",ЭтотОбъект);	
	ОткрытьФорму("РегистрСведений.ИзмеренияЧеловека.ФормаСписка",,ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнестиИзмененияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ОбновитьГрафик(Период.ДатаНачала,Период.ДатаОкончания);
	
КонецПроцедуры
